#### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Validation 🤖`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  
  ```terraform
  Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jujulego/ants/runs/run-vCfRDjBdeuTJFn7F

Waiting for the plan to start...

Terraform v1.2.7
on linux_amd64
Initializing plugins and modules...
data.aws_iam_policy_document.ants-authorized: Refreshing...
aws_cognito_user_pool.ants-user-pool: Refreshing state... [id=eu-west-3_A8Vxd3hvy]
data.aws_iam_policy_document.ants-authorized: Refresh complete after 0s [id=2279520873]
aws_cognito_user_pool_domain.ants: Refreshing state... [id=ants-dev]
aws_ssm_parameter.ants-user-pool-id: Refreshing state... [id=/ants/dev/user-pool-id]
aws_cognito_user_pool_client.ants-frontend: Refreshing state... [id=67rjs7399rsdq6scc31nrvcdbm]
aws_ssm_parameter.ants-auth-domain: Refreshing state... [id=/ants/dev/auth-domain]
aws_ssm_parameter.ants-client-id: Refreshing state... [id=/ants/dev/client-id]
aws_cognito_identity_pool.ants-identity-pool: Refreshing state... [id=eu-west-3:8a72a0d0-f5e9-4576-a6dd-3acd010c37b3]
aws_ssm_parameter.ants-identity-pool-id: Refreshing state... [id=/ants/dev/identity-pool-id]
aws_iam_role.ants-authorized-user: Refreshing state... [id=ants-authorized-user-dev]
aws_cognito_identity_pool_roles_attachment.ants-identity-pool: Refreshing state... [id=eu-west-3:8a72a0d0-f5e9-4576-a6dd-3acd010c37b3]
aws_cognito_identity_pool.ants-identity-pool: Drift detected (delete)
aws_cognito_identity_pool_roles_attachment.ants-identity-pool: Drift detected (delete)
aws_cognito_user_pool.ants-user-pool: Drift detected (delete)
aws_cognito_user_pool_client.ants-frontend: Drift detected (delete)
aws_cognito_user_pool_domain.ants: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_cognito_identity_pool.ants-identity-pool has been deleted
  - resource "aws_cognito_identity_pool" "ants-identity-pool" {
      - id                               = "eu-west-3:8a72a0d0-f5e9-4576-a6dd-3acd010c37b3" -> null
        tags                             = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cognito_user_pool.ants-user-pool has been deleted
  - resource "aws_cognito_user_pool" "ants-user-pool" {
      - endpoint                  = "cognito-idp.eu-west-3.amazonaws.com/eu-west-3_A8Vxd3hvy" -> null
      - id                        = "eu-west-3_A8Vxd3hvy" -> null
        name                      = "ants-user-pool-dev"
        tags                      = {}
        # (10 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_cognito_user_pool_client.ants-frontend has been deleted
  - resource "aws_cognito_user_pool_client" "ants-frontend" {
      - id                                            = "67rjs7399rsdq6scc31nrvcdbm" -> null
        name                                          = "ants-frontend-dev"
        # (19 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cognito_identity_pool.ants-identity-pool will be created
  + resource "aws_cognito_identity_pool" "ants-identity-pool" {
      + allow_classic_flow               = false
      + allow_unauthenticated_identities = false
      + arn                              = (known after apply)
      + id                               = (known after apply)
      + identity_pool_name               = "ants-identity-pool-dev"
      + tags_all                         = {
          + "Project" = "ants"
          + "STAGE"   = "dev"
        }

      + cognito_identity_providers {
          + client_id               = (known after apply)
          + provider_name           = (known after apply)
          + server_side_token_check = false
        }
    }

  # aws_cognito_identity_pool_roles_attachment.ants-identity-pool will be created
  + resource "aws_cognito_identity_pool_roles_attachment" "ants-identity-pool" {
      + id               = (known after apply)
      + identity_pool_id = (known after apply)
      + roles            = {
          + "authenticated" = "arn:aws:iam::220263915826:role/ants-authorized-user-dev"
        }
    }

  # aws_cognito_user_pool.ants-user-pool will be created
  + resource "aws_cognito_user_pool" "ants-user-pool" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "ants-user-pool-dev"
      + sms_verification_message   = (known after apply)
      + tags_all                   = {
          + "Project" = "ants"
          + "STAGE"   = "dev"
        }
      + username_attributes        = [
          + "email",
        ]

      + admin_create_user_config (known after apply)

      + password_policy (known after apply)

      + sms_configuration (known after apply)

      + username_configuration {
          + case_sensitive = false
        }

      + verification_message_template (known after apply)
    }

  # aws_cognito_user_pool_client.ants-frontend will be created
  + resource "aws_cognito_user_pool_client" "ants-frontend" {
      + allowed_oauth_flows                  = [
          + "code",
          + "implicit",
        ]
      + allowed_oauth_flows_user_pool_client = true
      + allowed_oauth_scopes                 = [
          + "email",
          + "openid",
          + "profile",
        ]
      + callback_urls                        = [
          + "http://localhost:4000/ants/",
          + "https://jujulego.github.io/ants/",
        ]
      + client_secret                        = (sensitive value)
      + enable_token_revocation              = (known after apply)
      + explicit_auth_flows                  = [
          + "ALLOW_REFRESH_TOKEN_AUTH",
        ]
      + generate_secret                      = false
      + id                                   = (known after apply)
      + logout_urls                          = [
          + "http://localhost:4000/ants/",
          + "https://jujulego.github.io/ants/",
        ]
      + name                                 = "ants-frontend-dev"
      + prevent_user_existence_errors        = (known after apply)
      + refresh_token_validity               = 30
      + supported_identity_providers         = [
          + "COGNITO",
        ]
      + user_pool_id                         = (known after apply)
    }

  # aws_cognito_user_pool_domain.ants will be created
  + resource "aws_cognito_user_pool_domain" "ants" {
      + aws_account_id              = (known after apply)
      + cloudfront_distribution_arn = (known after apply)
      + domain                      = "ants-dev"
      + id                          = (known after apply)
      + s3_bucket                   = (known after apply)
      + user_pool_id                = (known after apply)
      + version                     = (known after apply)
    }

  # aws_iam_role.ants-authorized-user will be updated in-place
  ~ resource "aws_iam_role" "ants-authorized-user" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "eu-west-3:8a72a0d0-f5e9-4576-a6dd-3acd010c37b3"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "ants-authorized-user-dev"
        name                  = "ants-authorized-user-dev"
        tags                  = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ssm_parameter.ants-client-id will be updated in-place
  ~ resource "aws_ssm_parameter" "ants-client-id" {
        id              = "/ants/dev/client-id"
      + insecure_value  = (known after apply)
        name            = "/ants/dev/client-id"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_ssm_parameter.ants-identity-pool-id will be updated in-place
  ~ resource "aws_ssm_parameter" "ants-identity-pool-id" {
        id              = "/ants/dev/identity-pool-id"
      + insecure_value  = (known after apply)
        name            = "/ants/dev/identity-pool-id"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_ssm_parameter.ants-user-pool-id will be updated in-place
  ~ resource "aws_ssm_parameter" "ants-user-pool-id" {
        id              = "/ants/dev/user-pool-id"
      + insecure_value  = (known after apply)
        name            = "/ants/dev/user-pool-id"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # data.aws_iam_policy_document.ants-authorized-assume-role will be read during apply
 <= data "aws_iam_policy_document" "ants-authorized-assume-role" {
      + id      = (known after apply)
      + json    = (known after apply)
      + version = "2012-10-17"

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

Plan: 5 to add, 4 to change, 0 to destroy.

Changes to Outputs:
  ~ AuthClientId       = "67rjs7399rsdq6scc31nrvcdbm" -> (known after apply)
  ~ AuthIdentityPoolId = "eu-west-3:8a72a0d0-f5e9-4576-a6dd-3acd010c37b3" -> (known after apply)
  ~ AuthUserPoolId     = "eu-west-3_A8Vxd3hvy" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```
  
  </details>
  *Pushed by: @renovate[bot], Action: `pull_request`*